<h1>Challenge 9</h1>

<h2>I</h2>

1. SELECT CustomerName, Country FROM Customers WHERE Country=='UK'
2. Select * from Customers INNER JOIN Orders ON Orders.CustomerID=Customers.CustomerID order by OrderDate DESC LIMIT 1;
3. select SupplierID, AVG(PRICE) from products group by SupplierID order by AVG(PRICE) DESC LIMIT 1
4. select count(distinct(COUNTRY))from customers
5. select CategoryName,* from categories join (select COUNT(CATEGORYID),* from orderdetails join Products on Products.ProductID=orderdetails.ProductID group by CategoryID order by COUNT(CATEGORYID) DESC limit 1) p on p.CategoryID=categories.CategoryID
6. select OrderID, sum(Price*Quantity) from products p join orderdetails o on o.productID=p.productid group by OrderID order by sum(Price*Quantity) DESC
7. select sum(q),* from orders join (select OrderID, sum(Price*Quantity) as q from products p join orderdetails o on o.productID=p.productid group by OrderID order by sum(Price*Quantity) DESC) z on z.orderid=orders.orderid group by Employeeid
8. select * from employees where Notes LIKE '%BS%'
9. select count(), avg(price), * from products group by supplierID having count()>2 order by avg(price) DESC

<h2>II</h2>

1. select sum(salary) from salaries;
2. create table fielding (playerID varchar(20) not null, yearID int not null, stint int not null, teamid varchar(3) not null, lgID varchar(2) not null, pos varchar(2) not null, G int not null, GS int null, innouts int, po int null, A int, E int, DP int, PB int, WP int, SB int null, CS int null, ZR int null, primary key (playerID, yearID, stint, teamID, lgID, POS, G));
COPY fielding FROM '/home/ubuntu/baseballdata/fielding.csv' DELIMITER ',' CSV HEADER;
select playerID, min(yearID), max(yearID) from fielding group by playerID;
3.  select playerID, sum(gamenum) from allstarfull group by playerID order by max(gamenum) Desc;
4.  create table schoolp (playerID varchar(20) not null, schoolID varchar(20) not null, yearmin int, yearmax int, primary key (playerID, schoolID));
copy schoolp from '/home/ubuntu/baseballdata/SchoolsPlayers.csv' DELIMITER ',' CSV HEADER;
select schoolid, count(*) from schoolp group by schoolid order by count(*) desc;
5. select playerID, max(yearID)-min(yearID) as q from fielding group by playerID order by q desc;
6. select min(m.q), max(m.q) from (select min(yearID) as q, playerID from fielding group by playerID) as m;

<h2>III</h2>

In [26]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('/home/sufyan/Downloads/database.sqlite')
c = conn.cursor()
c.execute("SELECT name FROM sqlite_master WHERE type = 'table' ORDER BY 1")
c.fetchall()

[('Country',),
 ('League',),
 ('Match',),
 ('Player',),
 ('Player_Attributes',),
 ('Team',),
 ('Team_Attributes',),
 ('sqlite_sequence',)]

<h3>1.</h3>

In [34]:
pd.read_sql_query("SELECT * FROM League", conn).head()

      id  country_id                    name
0      1           1  Belgium Jupiler League
1   1729        1729  England Premier League
2   4769        4769          France Ligue 1
3   7809        7809   Germany 1. Bundesliga
4  10257       10257           Italy Serie A

In [36]:
pd.read_sql_query("SELECT name, sum(home_team_goal), home_team_api_id FROM Match join league group by home_team_api_id order by sum(home_team_goal) desc limit 1", conn)

                       name  sum(home_team_goal)  home_team_api_id
0  Switzerland Super League                 5555              8633

<h3>2.</h3>

In [42]:
pd.read_sql_query("SELECT name, sum(away_team_goal), home_team_api_id FROM Match join league group by home_team_api_id order by sum(home_team_goal) desc limit 1", conn)

                       name  sum(away_team_goal)  home_team_api_id
0  Switzerland Super League                 1617              8633

<h3>3.</h3>

In [45]:
pd.read_sql_query("Select count(*) from match where home_team_goal=away_team_goal", conn)

   count(*)
0      6596

<h3>4.</h3>

In [59]:
# smith in last name
pd.read_sql_query("select count(*) from player where player_name like '% smith'", conn)

   count(*)
0        15

In [62]:
# Smith anywhere
pd.read_sql_query("select count(*) from player where player_name like '%smith%'", conn)

   count(*)
0        18

<h3>5.</h3>

In [82]:
pd.read_sql_query("Select home_team_goal+away_team_goal as a from match where home_team_goal=away_team_goal order by a asc limit 1 offset 6596/2", conn)

   a
0  2

<h3>6.</h3>

In [100]:
# prefers right foot percent
pd.read_sql_query("select count(*)*100 / (select count(*) from player_attributes) from player_attributes where preferred_foot='right'", conn)

   count(*)*100 / (select count(*) from player_attributes)
0                                                 75